app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    def index
      @rated = Movie.get_rated
      sequence = params[:sort]
      filt_rating = params[:ratings]
      #puts(filt_rating)
      if filt_rating != nil
      #  @movies = Movie.with_rated(filt_rating)
      #  return
        session[filt_rating] = filt_rating
      end

      if sequence != nil
        session[:sequence] = sequence
      end

      if sequence == nil and filt_rating == nil and (session[:filt_rating] != nil or session[:sequence] != nil)
        filt_rating = session[:filt_rating]
        sequence = session[:sequence]
        flash.keep
        redirect_to movies_path({sort:sequence, ratings:filt_rating})
      end

      sequence = session[:sequence]
      filt_rating = session[:filt_rating]

      if sequence == nil
        @movies = Movie.all()